Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8A.xml
<?xml version="1.0" encoding="UTF-8"?><!-- ============================================================================ --><!--                  Atmel Microcontroller Software Support                      --><!-- ============================================================================ --><!-- Copyright (c) 2014, Atmel Corporation                                        --><!--                                                                              --><!-- All rights reserved.                                                         --><!--                                                                              --><!-- Redistribution and use in source and binary forms, with or without           --><!-- modification, are permitted provided that the following condition is met:    --><!--                                                                              --><!-- - Redistributions of source code must retain the above copyright notice,     --><!-- this list of conditions and the disclaimer below.                            --><!--                                                                              --><!-- Atmel's name may not be used to endorse or promote products derived from     --><!-- this software without specific prior written permission.                     --><!--                                                                              --><!-- DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR    --><!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF --><!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   --><!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      --><!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT --><!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  --><!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    --><!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         --><!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, --><!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           --><!-- ============================================================================ --><avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="standard" package="QFP48_noLCD" speedmax="+0" tempmax="+0" tempmin="+0" vccmax="+0" vccmin="+0"/>
  </variants>
  <devices>
    <device name="ATSAM4LS8A" architecture="CORTEX-M4" family="SAM4" series="SAM4L">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x80000" type="flash" pagesize="512"/>
          <memory-segment name="USER_PAGE" start="0x800000" size="0x200" type="user_page" pagesize="512"/>
          <memory-segment name="USER_PAGE" start="0x00800000" size="0x200" type="user_page" pagesize="512"/>
          <memory-segment name="HRAMC0" start="0x20000000" size="0x10000" type="ram"/>
          <memory-segment name="HRAMC1" start="0x21000000" size="0x800" type="ram"/>
          <memory-segment name="HTOP0" start="0x40000000" size="0xA0000" type="io"/>
          <memory-segment name="HTOP1" start="0x400A0000" size="0x10000" type="io"/>
          <memory-segment name="HTOP2" start="0x400E0000" size="0x10000" type="io"/>
          <memory-segment name="HTOP3" start="0x400F0000" size="0x10000" type="io"/>
        <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x20000000" type="io"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x400A0014" size="8" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__BB_PRESENT" value="0"/>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__CONST_AHB_CTRL" value="0"/>
        <param name="__DEBUG_LVL" value="3"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__JTAG_PRESENT" value="1"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__TRACE_LVL" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
        <param name="__WIC_LINES" value="3"/>
        <param name="__WIC_PRESENT" value="0"/>
      </parameters>
      <peripherals>
        <module name="ABDACB" id="I7563" version="1.0.0">
          <instance name="ABDACB">
            <register-group name="ABDACB" name-in-module="ABDACB" address-space="base" offset="0x40064000"/>
            <signals>
              <signal group="CLK" function="C" pad="PA31"/>
              <signal group="CLK" function="C" pad="PC12"/>
              <signal group="DAC" index="0" function="C" pad="PA27"/>
              <signal group="DAC" index="0" function="C" pad="PB02"/>
              <signal group="DAC" index="0" function="C" pad="PC09"/>
              <signal group="DAC" index="0" function="B" pad="PA17"/>
              <signal group="DAC" index="1" function="C" pad="PA29"/>
              <signal group="DAC" index="1" function="C" pad="PB04"/>
              <signal group="DAC" index="1" function="C" pad="PC13"/>
              <signal group="DAC" index="1" function="B" pad="PA19"/>
              <signal group="DACN" index="0" function="C" pad="PA28"/>
              <signal group="DACN" index="0" function="C" pad="PB03"/>
              <signal group="DACN" index="0" function="C" pad="PC10"/>
              <signal group="DACN" index="0" function="B" pad="PA18"/>
              <signal group="DACN" index="1" function="C" pad="PA30"/>
              <signal group="DACN" index="1" function="C" pad="PB05"/>
              <signal group="DACN" index="1" function="C" pad="PC14"/>
              <signal group="DACN" index="1" function="B" pad="PA20"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="ACIFC" id="I7564" version="1.0.1">
          <instance name="ACIFC">
            <register-group name="ACIFC" name-in-module="ACIFC" address-space="base" offset="0x40040000"/>
            <signals>
              <signal group="ACAN" index="0" function="E" pad="PA06"/>
              <signal group="ACAN" index="1" function="E" pad="PC09"/>
              <signal group="ACAP" index="0" function="E" pad="PA07"/>
              <signal group="ACAP" index="1" function="E" pad="PC10"/>
              <signal group="ACBN" index="0" function="E" pad="PB02"/>
              <signal group="ACBN" index="1" function="E" pad="PC13"/>
              <signal group="ACBP" index="0" function="E" pad="PB03"/>
              <signal group="ACBP" index="1" function="E" pad="PC14"/>
            </signals>
          </instance>
        </module>
        <module name="ADCIFE" id="I7569" version="1.0.0">
          <instance name="ADCIFE">
            <register-group name="ADCIFE" name-in-module="ADCIFE" address-space="base" offset="0x40038000"/>
            <signals>
              <signal group="AD" index="0" function="A" pad="PA04"/>
              <signal group="AD" index="1" function="A" pad="PA05"/>
              <signal group="AD" index="2" function="A" pad="PA07"/>
              <signal group="AD" index="3" function="A" pad="PB02"/>
              <signal group="AD" index="4" function="A" pad="PB03"/>
              <signal group="AD" index="5" function="A" pad="PB04"/>
              <signal group="AD" index="6" function="A" pad="PB05"/>
              <signal group="AD" index="7" function="A" pad="PC07"/>
              <signal group="AD" index="8" function="A" pad="PC08"/>
              <signal group="AD" index="9" function="A" pad="PC09"/>
              <signal group="AD" index="10" function="A" pad="PC10"/>
              <signal group="AD" index="11" function="A" pad="PC11"/>
              <signal group="AD" index="12" function="A" pad="PC12"/>
              <signal group="AD" index="13" function="A" pad="PC13"/>
              <signal group="AD" index="14" function="A" pad="PC14"/>
              <signal group="ADVREFP" function="default" pad="ADVREFP_ADC"/>
              <signal group="TRIGGER" function="E" pad="PA05"/>
            </signals>
            <parameters>
              <param name="CHANNELS" value="16"/>
              <param name="CHANNEL_MSB" value="15"/>
              <param name="EXT_TRIGGERS_MSB" value="0"/>
              <param name="GCLK_NUM" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="AST" id="I7532" version="3.1.1">
          <instance name="AST">
            <register-group name="AST" name-in-module="AST" address-space="base" offset="0x400F0800"/>
            <parameters>
              <param name="CLK1K" value="4"/>
              <param name="CLK32" value="1"/>
              <param name="GCLK_NUM" value="2"/>
              <param name="GENCLK" value="3"/>
              <param name="PB" value="2"/>
              <param name="RCOSC" value="0"/>
            </parameters>
          </instance>
        </module>
