Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8A.xml
      <value-group name="IISC_IMR__RXRDY">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__TXRDY">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__TXUR">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_PARAMETER__FORMAT">
        <value name="I2S" caption="I2S format, stereo with IWS low for left channel" value="0"/>
      </value-group>
    </module>
    <module name="PARC" id="I7570" version="1.0.0" caption="Parallel Capture">
      <register-group name="PARC" caption="Parallel Capture">
        <register name="CFG" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="DSIZE" caption="Data Size" mask="0x3"/>
          <bitfield name="SMODE" caption="Sampling Mode" mask="0xC"/>
          <bitfield name="EMODE" caption="Events Mode" mask="0x10"/>
          <bitfield name="EDGE" caption="Sampling Edge Select" mask="0x20"/>
          <bitfield name="HALF" caption="Half Capture" mask="0x40"/>
          <bitfield name="ODD" caption="Odd Capture" mask="0x80"/>
        </register>
        <register name="CR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
          <bitfield name="START" caption="Start Capture" mask="0x4"/>
          <bitfield name="STOP" caption="Stop Capture" mask="0x8"/>
        </register>
        <register name="IER" offset="0x8" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Enable" mask="0x8"/>
        </register>
        <register name="IDR" offset="0xc" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Disable" mask="0x8"/>
        </register>
        <register name="IMR" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Mask" mask="0x8"/>
        </register>
        <register name="SR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="EN" caption="Enable Status" mask="0x1"/>
          <bitfield name="CS" caption="Capture Status" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status" mask="0x8"/>
        </register>
        <register name="ICR" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Interrupt Status Clear Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Status Clear" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status Clear" mask="0x8"/>
        </register>
        <register name="RHR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="CDATA" caption="Captured Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x20" rw="R" size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PDCA" id="I7514" version="1.2.4" caption="Peripheral DMA Controller">
      <register-group name="channel" size="0x40">
        <register name="MAR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Memory Address Register">
          <bitfield name="MADDR" caption="Memory Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="PSR" offset="0x4" rw="RW" size="4" caption="Peripheral Select Register">
          <bitfield name="PID" caption="Peripheral Identifier" mask="0xFF"/>
        </register>
        <register name="TCR" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Transfer Counter Register">
          <bitfield name="TCV" caption="Transfer Counter Value" mask="0xFFFF"/>
        </register>
        <register name="MARR" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Memory Address Reload Register">
          <bitfield name="MARV" caption="Memory Address Reload Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="TCRR" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Transfer Counter Reload Register">
          <bitfield name="TCRV" caption="Transfer Counter Reload Value" mask="0xFFFF"/>
        </register>
        <register name="CR" offset="0x14" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="TEN" caption="Transfer Enable" mask="0x1"/>
          <bitfield name="TDIS" caption="Transfer Disable" mask="0x2"/>
          <bitfield name="ECLR" caption="Error Clear" mask="0x100"/>
        </register>
        <register name="MR" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="SIZE" caption="Transfer size" mask="0x3" values="PDCA_MR__SIZE"/>
          <bitfield name="ETRIG" caption="Event trigger" mask="0x4"/>
          <bitfield name="RING" caption="Ring Buffer" mask="0x8"/>
        </register>
        <register name="SR" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="TEN" caption="Transfer Enabled" mask="0x1"/>
        </register>
