Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8A.xml
        <register name="IER" offset="0x20" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="IDR" offset="0x24" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="IMR" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="SCR" offset="0x2c" rw="W" size="4" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="PR" offset="0x30" rw="R" size="4" initval="0x00000001" caption="Parameter Register">
          <bitfield name="HS" caption="HS-mode" mask="0x1"/>
        </register>
        <register name="VR" offset="0x34" rw="R" size="4" initval="0x00000120" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="HSCWGR" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="HS-mode Clock Waveform Generator">
          <bitfield name="LOW" caption="Clock Low Cycles" mask="0xFF"/>
          <bitfield name="HIGH" caption="Clock High Cycles" mask="0xFF00"/>
          <bitfield name="STASTO" caption="START and STOP Cycles" mask="0xFF0000"/>
          <bitfield name="DATA" caption="Data Setup and Hold Cycles" mask="0xF000000"/>
          <bitfield name="EXP" caption="Clock Prescaler" mask="0x70000000"/>
        </register>
        <register name="SRR" offset="0x3c" rw="RW" size="4" initval="0x00000000" caption="Slew Rate Register">
          <bitfield name="DADRIVEL" caption="Data Drive Strength LOW" mask="0x7"/>
          <bitfield name="DASLEW" caption="Data Slew Limit" mask="0x300"/>
          <bitfield name="CLDRIVEL" caption="Clock Drive Strength LOW" mask="0x70000"/>
          <bitfield name="CLSLEW" caption="Clock Slew Limit" mask="0x3000000"/>
          <bitfield name="FILTER" caption="Input Spike Filter Control" mask="0x30000000"/>
        </register>
        <register name="HSSRR" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="HS-mode Slew Rate Register">
          <bitfield name="DADRIVEL" caption="Data Drive Strength LOW" mask="0x7"/>
          <bitfield name="DASLEW" caption="Data Slew Limit" mask="0x300"/>
          <bitfield name="CLDRIVEL" caption="Clock Drive Strength LOW" mask="0x70000"/>
          <bitfield name="CLDRIVEH" caption="Clock Drive Strength HIGH" mask="0x300000"/>
          <bitfield name="CLSLEW" caption="Clock Slew Limit" mask="0x3000000"/>
          <bitfield name="FILTER" caption="Input Spike Filter Control" mask="0x30000000"/>
        </register>
      </register-group>
    </module>
    <module name="TWIMS" version="1.0.0" caption="Two-wire Interface">
    </module>
    <module name="TWIS" id="I7537" version="1.4.0" caption="Two-wire Slave Interface">
      <register-group name="TWIS" caption="Two-wire Slave Interface">
        <register name="CR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="SEN" caption="Slave Enable" mask="0x1"/>
          <bitfield name="SMEN" caption="SMBus Mode Enable" mask="0x2"/>
          <bitfield name="SMATCH" caption="Slave Address Match" mask="0x4"/>
          <bitfield name="GCMATCH" caption="General Call Address Match" mask="0x8"/>
          <bitfield name="STREN" caption="Clock Stretch Enable" mask="0x10"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x80"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x100"/>
          <bitfield name="SMDA" caption="SMBus Default Address" mask="0x200"/>
          <bitfield name="SMHH" caption="SMBus Host Header" mask="0x400"/>
          <bitfield name="PECEN" caption="Packet Error Checking Enable" mask="0x800"/>
          <bitfield name="ACK" caption="Slave Receiver Data Phase ACK Value" mask="0x1000"/>
          <bitfield name="CUP" caption="NBYTES Count Up" mask="0x2000"/>
          <bitfield name="SOAM" caption="Stretch Clock on Address Match" mask="0x4000"/>
          <bitfield name="SODR" caption="Stretch Clock on Data Byte Reception" mask="0x8000"/>
          <bitfield name="ADR" caption="Slave Address" mask="0x3FF0000"/>
          <bitfield name="TENBIT" caption="Ten Bit Address Match" mask="0x4000000"/>
          <bitfield name="BRIDGE" caption="Bridge Control Enable" mask="0x8000000"/>
        </register>
        <register name="NBYTES" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="NBYTES Register">
          <bitfield name="NBYTES" caption="Number of Bytes to Transfer" mask="0xFF"/>
        </register>
        <register name="TR" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Timing Register">
          <bitfield name="TLOWS" caption="SMBus Tlow:sext Cycles" mask="0xFF"/>
          <bitfield name="TTOUT" caption="SMBus Ttimeout Cycles" mask="0xFF00"/>
          <bitfield name="SUDAT" caption="Data Setup Cycles" mask="0xFF0000"/>
          <bitfield name="EXP" caption="Clock Prescaler" mask="0xF0000000"/>
        </register>
        <register name="RHR" offset="0xc" rw="R" size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="RXDATA" caption="Received Data Byte" mask="0xFF"/>
        </register>
        <register name="THR" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Transmit Holding Register">
          <bitfield name="TXDATA" caption="Data Byte to Transmit" mask="0xFF"/>
        </register>
        <register name="PECR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Packet Error Check Register">
          <bitfield name="PEC" caption="Calculated PEC Value" mask="0xFF"/>
        </register>
