Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS8A.xml
        <register name="UPCFG3" offset="0x50c" rw="RW" size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG3__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG3__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG3__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG3__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG4" offset="0x510" rw="RW" size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG4__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG4__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG4__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG4__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG5" offset="0x514" rw="RW" size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG5__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG5__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG5__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG5__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG6" offset="0x518" rw="RW" size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG6__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG6__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG6__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG6__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG7" offset="0x51c" rw="RW" size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG7__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG7__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG7__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG7__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPSTA0" offset="0x530" rw="R" size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
        <register name="UPSTA1" offset="0x534" rw="R" size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
        <register name="UPSTA2" offset="0x538" rw="R" size="4" initval="0x00000000" caption="Pipe Status Register">
          <bitfield name="RXINI" caption="Received IN Data Interrupt" mask="0x1"/>
          <bitfield name="TXOUTI" caption="Transmitted OUT Data Interrupt" mask="0x2"/>
          <bitfield name="TXSTPI" caption="Transmitted SETUP Interrupt" mask="0x4"/>
          <bitfield name="PERRI" caption="Pipe Error Interrupt" mask="0x8"/>
          <bitfield name="NAKEDI" caption="NAKed Interrupt" mask="0x10"/>
          <bitfield name="ERRORFI" caption="Errorflow Interrupt" mask="0x20"/>
          <bitfield name="RXSTALLDI" caption="Received STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x400"/>
          <bitfield name="NBUSYBK" caption="Number of Busy Bank" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
        </register>
